#include <stdlib.h>
#include <stdio.h>

void
prTxt1()
{
	printf("Электрическая цепь составлена по схеме, приведённой на рисунке. ");
	printf("Событие Ai, i = 1,2,3,4,5 \nсостоят в том, что одноименные ");
	printf("элементы работают безотказно в течении времени T, p(Ai)=pi.\n");
	printf("Найти вероятность события B - схема работает безотказно ");
	printf("в течении времени T\n");
}

void
prTxt2()
{
	printf("Один студент выучил m1 из n вопросов программы, а второй m2.\n");
	printf("Каждому из них задают по три вопроса. Найти вероятность того,\nчто на все три вопроса правильно ответят:\n");
	printf("          a) оба студента\n");
	printf("          b) только первый студент\n");
	printf("          c) только один студент\n");
	printf("          d) хотя бы 1 студент\n");
}

void
prArt()
{
	printf("                                        _________                      \n");
	printf("                                   ____|         |___                  \n");
	printf("                                  |    |    2    |   |                 \n");
	printf("                       _________  |    |_________|   |  _________      \n");
	printf("                      |         | |     _________    | |         |     \n");
	printf("                  ____|    1    |_|____|         |___|_|    5    |____ \n");
	printf("                      |_________| |    |    3    |   | |_________|     \n");
	printf("                                  |    |_________|   |                 \n");
	printf("                                  |     _________    |                 \n");
	printf("                                  |____|         |___|                 \n");
	printf("                                       |    4    |                     \n");
	printf("                                       |_________|                     \n");
}

void
prAns1()
{
	printf("Решение:\n");
	printf("Элементы 2,3,4 включены параллельно, значит эта часть схемы будет работать, если хотя бы 1 из них \nбудет исправен\n");
	printf("Элементы 1, часть схемы, содержащий элементы 2,3,4 и элемент 5 включены последовательно,\n");
	printf("значит схема будет исправна, когда каждая часть будте исправно. Тогда событие B - схема исправна =\n");
	printf("= A1(A2+A3+A4)A5\n");
	printf("Найдёт P(B). P(B) = P(A1(A2+A3+A4)A5) = (т.к работа каждого элемента независима) = \n = P(A1)*P(A5)*P(A2+A3+A4) = ");
	printf("P(A1)*P(A5)*(1-P(|A2)*P(|A3)*P(|A4)\n");
}

void
prAns2()
{
	printf("а) Событие B=a)=A1*A2 - где A1,A2 - 1,2 студент ответил на 3 вопроса\n");
	printf("p(B) = p(A1*A2) = (т.к A1 и A2 независимы) = p(A1)*p(A2)\n\n");
	printf("b) Событие B=b)=A1*|A2\n");
	printf("p(B) = p(A1*|A2) = (т.к A1 и |A2 независимы) = p(A1)*(1- p(A2))\n\n");
	printf("c) Событие B=c)=A1*|A2 + |A1*A2\n");
	printf("p(B) = p(A1*|A2 + |A1*A2) = (т.к A1*|A2 и |A1*A2 несовместны) = p(A1)*(1- p(A2)) +(1-p(A1))*p(A2)\n\n");
	printf("d) Событие B=d)=A1 + A2\n");
	printf("p(B) = p(A1 + A2) = (т.к A1 и A2 независимы) = 1 - (1-p(A1))(1-p(A2))\n\n");
}

int
prInOut1()
{
	double p[5] = {0};
	printf("Введите данные:\n");
	for (int i = 0; i < 5; i++)
	{
		printf("P(A%d) = ",i);
		scanf("%lf",&p[i]);
		if(!(p[i] <= 1 && p[i]>=0)){
			return 1;
		}
	}
	printf("Вероятность события B:\nP(B)= %lf\n",p[0]*p[4]*(1-(1-p[1])*(1-p[2])*(1-p[3])));
	return 0;
}

int 
prInOut2()
{
	int m1,m2,n;
	double p[2];
	printf("Введите данные:\n");
	printf("m1 = ");
	scanf("%d",&m1);
	printf("m2 = ");
	scanf("%d",&m2);
	printf("n = ");
	scanf("%d",&n);
	if(m1 < 0 || m2 < 0 || m1 > n || m2 > n){
		return 1;
	}
	p[0] = (double)m1*(m1-1)*(m1-2)/(n*(n-1)*(n-2));
	p[1] = (double)m2*(m2-1)*(m2-2)/(n*(n-1)*(n-2));
	printf("a) p(B) = %lf\n\n",p[0]*p[1]);
	printf("b) p(B) = %lf\n\n",p[0]*(1-p[1]));
	printf("c) p(B) = %lf\n\n",p[0]*(1-p[1]) + p[1]*(1-p[0]));
	printf("d) p(B) = %lf\n\n",1 - (1-p[0])*(1-p[1]));
}

int
main(void)
{
	int n;
	int flg = 0;
	printf("Введите номер задачи(1 или 2):");
	scanf("%d",&n);
	if(n == 1){
		flg = 1;
		prTxt1();
		prArt();
		prAns1();
		if(prInOut1()){
			printf("Данные некорретны\n");
		}
	}
	if(n == 2){
		flg = 1;
		prTxt2();
		prAns2();
		if(prInOut2()){
			printf("Данные некорретны\n");
		}
	}
	if(!flg){
		printf("Номер задачи некорректен\n");
	}
}